# SQL for Data Science

## Connection

[PostgresSQL Tutorial](https://www.postgresqltutorial.com/postgresql-python/connect/)

### Import libraries

In [18]:
# !pip install psycopg2
import psycopg2
import pandas as pd

### Create Connection & Cursor

In [61]:
#change user and password to your settings ☜(ﾟヮﾟ☜)
# port: the port number that defaults to 5432 if it is not provided.
conn = psycopg2.connect(host="localhost",database="data_sci", user="postgres", password="password", port=5432)
cur = conn.cursor()

Code Template:
```python
cur = conn.cursor()
command = """SQL DDL/DML Command"""
cur.execute(command)
cur.fetchone()
cur.fetchall()
cur.close()
con.commit()
con.close()
```

## Executing Commands

Version Check and Connection

In [20]:
cur.execute("""SELECT version()
                """)
cur.fetchone()

('PostgreSQL 12.2, compiled by Visual C++ build 1914, 64-bit',)

To check whether the cursor or the connection is connected:

In [21]:
conn is None and cur is None

False

In [22]:
cur

In [23]:
conn

## Show Tables using PostgreSQL

If you are coming from MySQL, you may miss the SHOW TABLES statement that displays all tables in a specific database. PostgreSQL does not provide the SHOW TABLES statement directly but give you something similar ¯\_(ツ)_/¯.

In [29]:
command = """SELECT
   *
FROM
   pg_catalog.pg_tables
WHERE
   schemaname != 'pg_catalog'
AND schemaname != 'information_schema';"""
cur.execute(command)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,company_divisions,postgres,None,True,False,False,False
1,public,company_regions,postgres,None,True,False,False,False
2,public,staff,postgres,None,True,False,False,False

## Checking the Tables

In [30]:
command = """SELECT * FROM company_divisions;"""
cur.execute(command)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department      company_division
0    Automotive       Auto & Hardware
1          Baby              Domestic
2        Beauty              Domestic
3      Clothing              Domestic
4     Computers  Electronic Equipment
5   Electronics  Electronic Equipment
6         Games              Domestic
7        Garden     Outdoors & Garden
8       Grocery              Domestic
9        Health              Domestic
10         Home              Domestic
11   Industrial       Auto & Hardware
12     Jewelery               Fashion
13         Kids              Domestic
14       Movies         Entertainment
15        Music         Entertainment
16     Outdoors     Outdoors & Garden
17        Shoes              Domestic
18       Sports        Games & Sports
19        Tools       Auto & Hardware
20         Toys        Games & Sports

In [31]:
command = """SELECT * FROM company_regions;"""
cur.execute(command)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

   region_id   company_regions country
0          1         Northeast     USA
1          2         Southeast     USA
2          3         Northwest     USA
3          4         Southwest     USA
4          5  British Columbia  Canada
5          6            Quebec  Canada
6          7       Nova Scotia  Canada

In [32]:
command = """SELECT * FROM staff;"""
cur.execute(command)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,id,last_name,email,gender,department,start_date,salary,job_title,region_id
0,1,Kelley,rkelley0@soundcloud.com,Female,Computers,2009-10-02,67470,Structural Engineer,2
1,2,Armstrong,sarmstrong1@infoseek.co.jp,Male,Sports,2008-03-31,71869,Financial Advisor,2
2,3,Carr,fcarr2@woothemes.com,Male,Automotive,2009-07-12,101768,Recruiting Manager,3
3,4,Murray,jmurray3@gov.uk,Female,Jewelery,2014-12-25,96897,Desktop Support Technician,3
4,5,Ellis,jellis4@sciencedirect.com,Female,Grocery,2002-09-19,63702,Software Engineer III,7
...,...,...,...,...,...,...,...,...,...
995,996,James,tjamesrn@soundcloud.com,Female,Games,2013-11-17,78433,Accountant II,7
996,997,Reynolds,dreynoldsro@blogtalkradio.com,Female,Computers,2007-04-16,120138,Statistician IV,1
997,998,Walker,kwalkerrp@unicef.org,Female,Games,2010-02-13,60363,Account Coordinator,1
998,999,Kennedy,lkennedyrq@edublogs.org,Male,Industrial,2004-09-22,48050,Graphic Designer,2
999,1000,Howard,showardrr@addtoany.com,Male,Baby,2003-11-07,148687,General Manager,3

# Count

In [39]:
command = """SELECT gender, COUNT(gender) FROM staff
             GROUP BY gender;"""
cur.execute(command)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

   gender  count
0  Female    496
1    Male    504

# MIN, MAX

In [43]:
command = """SELECT department, gender, MIN(salary), MAX(salary) FROM staff
             GROUP BY department, gender
             ORDER BY department, gender;"""
cur.execute(command)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

#Pretty Cool huh! ☜(ﾟヮﾟ☜)

     department  gender    min     max
0    Automotive  Female  42602  136448
1    Automotive    Male  44377  146167
2          Baby  Female  50448  141464
3          Baby    Male  42924  148687
4        Beauty  Female  41299  143853
5        Beauty    Male  40254  149099
6         Books  Female  47131  145284
7         Books    Male  42714  146745
8      Clothing  Female  42797  148408
9      Clothing    Male  43067  130188
10    Computers  Female  46960  149336
11    Computers    Male  47541  139304
12  Electronics  Female  41697  149597
13  Electronics    Male  40218  144073
14        Games  Female  42347  149221
15        Games    Male  41516  145575
16       Garden  Female  51792  148860
17       Garden    Male  50057  144965
18      Grocery  Female  45486  149929
19      Grocery    Male  44919  148993
20       Health  Female  43431  145962
21       Health    Male  43986  142967
22         Home  Female  40415  149598
23         Home    Male  44593  146432
24   Industrial  Female  54876  140850
25   Industrial    Male  40194  148816
26     Jewelery  Female  46653  145281
27     Jewelery    Male  41026  149114
28         Kids  Female  43097  149351
29         Kids    Male  44093  139163
30       Movies  Female  51132  142840
31       Movies    Male  41898  146970
32        Music  Female  42759  144608
33        Music    Male  43940  138540
34     Outdoors  Female  43366  148906
35     Outdoors    Male  46072  144932
36        Shoes  Female  52041  147739
37        Shoes    Male  45463  140243
38       Sports  Female  52792  146611
39       Sports    Male  40418  147166
40        Tools  Female  44788  149586
41        Tools    Male  47271  144661
42         Toys  Female  40138  144991
43         Toys    Male  41855  149835

# Sum & Average & Variance & Standard Deviation

In [55]:
command = """SELECT 
             department, 
             SUM(salary) AS total_salary, 
             AVG(salary) AS average_salary,
             var_pop(salary) AS variance_salary,
             stddev_pop(salary) AS standard_deviation_salary 
             FROM staff
             GROUP BY department
             ORDER BY total_salary;"""
cur.execute(command)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,department,total_salary,average_salary,variance_salary,standard_deviation_salary
0,Music,3274767,88507.216216216216,1001696601.52081812,31649.59085866
1,Kids,3543027,93237.552631578947,1072987422.93144044,32756.48673059
2,Movies,3632825,100911.805555555556,876898879.10108025,29612.47843564
3,Sports,3756041,93901.025000000000,1049150239.87437500,32390.58875467
4,Toys,3943674,96187.170731707317,1150709491.31231410,33922.10918136
5,Shoes,3968118,92281.813953488372,849306565.17468902,29142.86473864
6,Jewelery,4039362,87812.217391304348,875256537.77882798,29584.73487762
7,Tools,4095808,105020.717948717949,795868561.02301118,28211.14249766
8,Baby,4218724,93749.422222222222,912220932.82172840,30202.99542797
9,Industrial,4366340,92900.851063829787,889271955.27569036,29820.66322662
10,Books,4459837,94890.148936170213,945765035.82888185,30753.29308918
11,Electronics,4489141,91615.122448979592,1073778518.02582257,32768.55990162
12,Health,4552880,98975.652173913043,1216304238.79206049,34875.55359836
13,Automotive,4584268,99658.000000000000,929902811.86956522,30494.30786015
14,Grocery,4651241,101113.934782608696,1161021316.10444234,34073.76286976
15,Garden,4792085,101959.255319148936,909562157.08374830,30158.94820918
16,Home,4822205,92734.711538461538,1037243300.97448225,32206.26182863
17,Clothing,5037890,95054.528301886792,1000324590.36240655,31627.90840954
18,Games,5090304,103883.755102040816,1040425239.16451479,32255.62337275
19,Computers,5152963,99095.442307692308,930175201.51590237,30498.77377069
20,Outdoors,5378660,112055.416666666667,745849798.45138889,27310.25079437
21,Beauty,5481063,103416.283018867925,952478558.54254183,30862.25135246

# Rounding by n decimal points

In [57]:
command = """SELECT 
             department, 
             SUM(salary) AS total_salary, 
             ROUND(AVG(salary),2) AS average_salary,
             ROUND(var_pop(salary),2) AS variance_salary,
             ROUND(stddev_pop(salary),2) AS standard_deviation_salary 
             FROM staff
             GROUP BY department
             ORDER BY total_salary;"""
cur.execute(command)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,department,total_salary,average_salary,variance_salary,standard_deviation_salary
0,Music,3274767,88507.22,1001696601.52,31649.59
1,Kids,3543027,93237.55,1072987422.93,32756.49
2,Movies,3632825,100911.81,876898879.10,29612.48
3,Sports,3756041,93901.03,1049150239.87,32390.59
4,Toys,3943674,96187.17,1150709491.31,33922.11
5,Shoes,3968118,92281.81,849306565.17,29142.86
6,Jewelery,4039362,87812.22,875256537.78,29584.73
7,Tools,4095808,105020.72,795868561.02,28211.14
8,Baby,4218724,93749.42,912220932.82,30203.00
9,Industrial,4366340,92900.85,889271955.28,29820.66
10,Books,4459837,94890.15,945765035.83,30753.29
11,Electronics,4489141,91615.12,1073778518.03,32768.56
12,Health,4552880,98975.65,1216304238.79,34875.55
13,Automotive,4584268,99658.00,929902811.87,30494.31
14,Grocery,4651241,101113.93,1161021316.10,34073.76
15,Garden,4792085,101959.26,909562157.08,30158.95
16,Home,4822205,92734.71,1037243300.97,32206.26
17,Clothing,5037890,95054.53,1000324590.36,31627.91
18,Games,5090304,103883.76,1040425239.16,32255.62
19,Computers,5152963,99095.44,930175201.52,30498.77
20,Outdoors,5378660,112055.42,745849798.45,27310.25
21,Beauty,5481063,103416.28,952478558.54,30862.25

# Filtering & Joining

In [62]:
command = """SELECT *
             FROM staff
             INNER JOIN company_regions
             USING (region_id)
             INNER JOIN company_divisions
             USING (department)
             WHERE company_division IN ('Electronic Equipment', 'Games & Sports')
             AND
             department = 'Electronics'
             AND
             last_name ILIKE 's%'"""
cur.execute(command)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,department,region_id,id,last_name,email,gender,start_date,salary,job_title,company_regions,country,company_division
0,Electronics,1,985,Stevens,hstevensrc@hugedomains.com,Male,2006-02-28,118791,Safety Technician IV,Northeast,USA,Electronic Equipment
1,Electronics,1,906,Spencer,sspencerp5@mtv.com,Male,2014-04-18,110881,Electrical Engineer,Northeast,USA,Electronic Equipment
2,Electronics,2,679,Stone,pstoneiu@narod.ru,Male,2014-05-15,40218,Paralegal,Southeast,USA,Electronic Equipment
3,Electronics,7,762,Stanley,cstanleyl5@springer.com,Male,2013-08-09,103237,Account Executive,Nova Scotia,Canada,Electronic Equipment

In [63]:
#if the joining column names are not the same then:

command = """SELECT *
             FROM staff s
             INNER JOIN company_regions cr
             ON cr.region_id=s.region_id
             INNER JOIN company_divisions cd
             ON s.department=cd.department
             WHERE company_division IN ('Electronic Equipment', 'Games & Sports')
	         AND
	         s.department = 'Electronics'
	         AND
	         last_name ILIKE 's%'"""
cur.execute(command)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,id,last_name,email,gender,department,start_date,salary,job_title,region_id,region_id,company_regions,country,department,company_division
0,985,Stevens,hstevensrc@hugedomains.com,Male,Electronics,2006-02-28,118791,Safety Technician IV,1,1,Northeast,USA,Electronics,Electronic Equipment
1,906,Spencer,sspencerp5@mtv.com,Male,Electronics,2014-04-18,110881,Electrical Engineer,1,1,Northeast,USA,Electronics,Electronic Equipment
2,679,Stone,pstoneiu@narod.ru,Male,Electronics,2014-05-15,40218,Paralegal,2,2,Southeast,USA,Electronics,Electronic Equipment
3,762,Stanley,cstanleyl5@springer.com,Male,Electronics,2013-08-09,103237,Account Executive,7,7,Nova Scotia,Canada,Electronics,Electronic Equipment

In [ ]:
cur.close()
conn.close()